app/controllers/users_controller.rb

  def create
    #@user = User.new(username: params[:username], email: params[:email], password: params[:password])
     @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "oj"], ["email", "a@hotmail.com"], ["password", "789456"], ["created_at", "2021-03-26 19:38:40.014642"], ["updated_at", "2021-03-26 19:38:40.014642"]]

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "rashad@admin.com"], ["password", "123456"], ["updated_at", "2021-03-26 21:47:05.699377"], ["id", 4]]